nouraldeen417/atmega32/Smart_Home_Code/Slave/HAL/LCD/LCD_config.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/* 
 * File:   
 * Author: 
 * Comments:
 * Revision history: 
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef XC_LCD_CONFIG_H
#define	XC_LCD_CONFIG_H
/**********************************************************************************************************************
 * INCLUDES
 *********************************************************************************************************************/
#include <xc.h> // include processor files - each processor file is guarded.  
#include "../../lip/STD_TYPES.h"
#include "../../MCAL/DIO/DIO_interface.h"
/**********************************************************************************************************************
 *  GLOBAL CONSTANT MACROS
 *********************************************************************************************************************/
#define LCD_Data_PORT     DIO_PORTD
#define LCD_Control_PORT  DIO_PORTD
#define LCD_RS_PIN        DIO_PIN5
#define LCD_RW_PIN        DIO_PIN6
#define LCD_EN_PIN        DIO_PIN7
#define LCD_MODE              4

#if     LCD_MODE ==4
/*4 BIT MODE*/
#define LCD_PINS_0_3     0      // Pins 0:3 
#define LCD_PINS_4_8     1     // Pins 4:8

#define LCD_DATA_PIN         LCD_PINS_0_3
#if LCD_DATA_PIN == LCD_PINS_0_3
#define LCD_DATA_PIN1        DIO_PIN0
#define LCD_DATA_PIN2        DIO_PIN1
#define LCD_DATA_PIN3        DIO_PIN2
#define LCD_DATA_PIN4        DIO_PIN3
#elif LCD_DATA_PIN == LCD_PINS_4_8
#define LCD_DATA_PIN1        DIO_PIN4
#define LCD_DATA_PIN2        DIO_PIN5
#define LCD_DATA_PIN3        DIO_PIN6
#define LCD_DATA_PIN4        DIO_PIN7
#else
#endif
#endif
/**********************************************************************************************************************
 *  GLOBAL FUNCTION MACROS
 *********************************************************************************************************************/

/**********************************************************************************************************************
 *  GLOBAL DATA TYPES AND STRUCTURES
 *********************************************************************************************************************/

#ifdef	__cplusplus
extern "C" {
#endif /* __cplusplus */

    // TODO If C++ is being used, regular C code needs function names to have C 
    // linkage so the functions can be used by the c code. 

#ifdef	__cplusplus
}
#endif /* __cplusplus */

#endif	/* XC_HEADER_TEMPLATE_H */

